import {useEffect} from "react";
import {login} from "../services/api.service.ts";
//створюємо і експортуємо компонент, він відображає сторінку логіна
export const LoginPage = () => {
    //викликаємо ефект, він виконує функцію одразу після першого рендера компонента. Він викликає API для виконнаня входу
    useEffect(() => {
        //викликаємо функцію login з об'єктом параметрів
        login({
            username: 'emilys',//ім'я користувача для входу
            password: 'emilyspass',//пароль користувача
            expiresInMins: 1// час дії сесії в хвилинах
        });

        //пустий масив залежностей. Він означає що ефект буде виконаний тільки один раз.
    }, []);

    return (
        <>
            login Page
        </>
    );
};