import {Outlet} from "react-router-dom";
import Menu from "../components/menu/Menu.tsx";
//створюємо та експортуємо макет для відображення сторінок
export const MainLayout = () => {
    return (
        <>
            {/*//додаємо компонент з навігацією */}
            <Menu/>
            {/*//Додаємо контейнер для дочірніх маршрутів, якщо нинішній маршрут співпадає з одним із дочірніх, в Оутлет, буде*/}
            {/*відмальовано відповідний компонент*/}
            <Outlet/>
        </>
    );
};